---
type: BooleanOperationsUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# BooleanOperationsUtils

`Autodesk.Revit.DB.BooleanOperationsUtils` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CutWithHalfSpace | 2016 | `public static Solid CutWithHalfSpace ( Solid solid , Plane plane )` |
| Method | CutWithHalfSpaceModifyingOriginalSolid | 2016 | `public static void CutWithHalfSpaceModifyingOriginalSolid ( Solid solid , Plane plane )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | ExecuteBooleanOperation | 2012 | `public static Solid ExecuteBooleanOperation ( Solid solid0 , Solid solid1 , BooleanOperationsType booleanType )` |
| Method | ExecuteBooleanOperationModifyingOriginalSolid | 2012 | `public static void ExecuteBooleanOperationModifyingOriginalSolid ( Solid solid0 , Solid solid1 , BooleanOperationsType booleanType )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |